app/controllers/pets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = $1  [["user_id", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @pets = Pet.where(user_id: @user.id)